function drawRadio() {
    //画主驾和副驾
    noStroke()
    fill(92, 87, 74); // 填充颜色为
    rect(0, 410, 1280, 400); // 绘制矩形地面部分，覆盖画布下方

    // 绘制收音机背景
    noStroke(); // 去掉描边
    fill(100, 100, 100); // 灰色填充
    rect(390, 410, 500, 400); // 绘制背景矩形，覆盖下半部分屏幕

    // 绘制CD插槽
    stroke(75, 75, 75); // 设置边框颜色为较深的灰色
    strokeWeight(3); // 设置边框粗细
    fill(50, 50, 50); // 深灰色填充
    rect(470, 490, 350, 7, 10); // 绘制插槽矩形，圆角半径为10

    // 绘制收音机的框架
    stroke(75, 75, 75); // 深灰色边框
    strokeWeight(5); // 边框粗细为5
    noFill(); // 不填充
    rect(425, 470, 430, 200, 10); // 绘制无填充的矩形框架，圆角半径为10

    // 后视镜颈托
    noStroke(); // 去掉描边
    fill(50, 50, 50); // 深灰色填充
    rect(620, 0, 50, 50); // 绘制镜面矩形，位于顶部中央

    // 绘制镜面下方的装饰矩形
    stroke(50, 50, 50); // 设置边框颜色为深灰色
    strokeWeight(7); // 设置边框粗细
    fill(180, 200, 255); // 浅蓝色填充
    rect(500, 30, 300, 60, 20); // 绘制装饰矩形，圆角半径为40

    // 绘制收音机的屏幕
    stroke(75, 75, 75); // 边框颜色为深灰色
    strokeWeight(5); // 边框粗细为5
    fill(95, 145, 70); // 绿色填充
    rect(505, 520, 270, 55, 10); // 绘制屏幕矩形，圆角半径为10

    // 绘制更多的按钮
    stroke(75, 75, 75); // 边框颜色为深灰色
    strokeWeight(3); // 边框粗细为3
    fill(55, 55, 55); // 深灰色填充
    ellipse(465, 545, 50, 50); // 绘制左侧的按钮（圆形）
    ellipse(815, 545, 50, 50); // 绘制右侧的按钮（圆形）

    // 绘制磁带插槽
    stroke(75, 75, 75); // 边框颜色为深灰色
    strokeWeight(3); // 边框粗细为3
    fill(50, 50, 50); // 深灰色填充
    rect(540, 590, 200, 20, 7); // 绘制磁带插槽矩形，圆角半径为7

}
